In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([2,np.nan,6,np.nan],index=['a','b','c','d'])

In [3]:
ser1

a    2.0
b    NaN
c    6.0
d    NaN
dtype: float64

In [4]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
             index=['a','b','c','d'])

In [5]:
ser2

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [6]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

a    2.0
b    1.0
c    6.0
d    3.0
dtype: float64

In [7]:
ser1.combine_first(ser2)

a    2.0
b    1.0
c    6.0
d    3.0
dtype: float64

In [9]:
nan=np.nan
df = DataFrame({'x':[1.,nan,3.],
               'y':[5.,7.,nan]})

In [10]:
df

     x    y
0  1.0  5.0
1  NaN  7.0
2  3.0  NaN

In [11]:
dfe = DataFrame({'x':[2.,4.,6.]})

In [12]:
df.combine_first(dfe)

     x    y
0  1.0  5.0
1  4.0  7.0
2  3.0  NaN

Here the df.combine_first checks the df where there are null values and replaces them with the dfe.

In [13]:
dfe.combine_first(df)

     x    y
0  2.0  5.0
1  4.0  7.0
2  6.0  NaN